aethaniel/emBlocks_sam_patch/share/em_armgcc/lib/atmel/atsam3/atsam3n/include/atsam3n.h
#ifndef _1289AFC5_13CE_4642_9B5D_BB3E9A0DF5FC_
#define _1289AFC5_13CE_4642_9B5D_BB3E9A0DF5FC_

#if defined __ATSAM3N00A__
  #include "atsam3n00a.h"
#elif defined __ATSAM3N0A__
  #include "atsam3n0a.h"
#elif defined __ATSAM3N00B__
  #include "atsam3n00b.h"
#elif defined __ATSAM3N0B__
  #include "atsam3n0b.h"
#elif defined __ATSAM3N0C__
  #include "atsam3n0c.h"
#elif defined __ATSAM3N1A__
  #include "atsam3n1a.h"
#elif defined __ATSAM3N1B__
  #include "atsam3n1b.h"
#elif defined __ATSAM3N1C__
  #include "atsam3n1c.h"
#elif defined __ATSAM3N2A__
  #include "atsam3n2a.h"
#elif defined __ATSAM3N2B__
  #include "atsam3n2b.h"
#elif defined __ATSAM3N2C__
  #include "atsam3n2c.h"
#elif defined __ATSAM3N4A__
  #include "atsam3n4a.h"
#elif defined __ATSAM3N4B__
  #include "atsam3n4b.h"
#elif defined __ATSAM3N4C__
  #include "atsam3n4c.h"
#else
  #error Device not supported.
#endif

#endif /* _1289AFC5_13CE_4642_9B5D_BB3E9A0DF5FC_ */
